FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
        // Sound duration: 2 seconds (2000 ms)
        if (elapsed_time >= 1000) {
            // Stop the sound
            HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
            vcu.r2d_sound_playing = false;
            vcu.r2d_sound_completed = true;

            printf("\n\rR2D Sound: Completed\n\r");
        }
    }
}

/**
 * @brief Reset the Ready-To-Drive sound state
 * @details Resets the R2D sound flags when leaving a ready state.
 */
void ResetR2DSound(void) {
    vcu.r2d_sound_playing = false;
    vcu.r2d_sound_completed = false;
    HAL_GPIO_WritePin(GPIOD, dout4_R2D_Buzzer_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Update the state of the VCU based on inputs and conditions
 */
void UpdateState(void) {
    // Store current state for change detection
    previous_state = current_state;

    // Process emergency condition with highest priority
    if (vcu.AS_emergency && current_state != STATE_AS_EMERGENCY) {
        current_state = STATE_AS_EMERGENCY;
        return;  // Exit early - emergency takes precedence
    }

    // Read raw button state
    bool current_r2d_button = HAL_GPIO_ReadPin(int2_r2d_GPIO_Port, int2_r2d_Pin);

    // Detect rising edge (button press) for toggle behavior
    if (current_r2d_button && !vcu.r2d_button_prev) {
        vcu.r2d_toggle_signal = !vcu.r2d_toggle_signal;  // Toggle on button press
    }

    // Store current button state for next iteration
    vcu.r2d_button_prev = current_r2d_button;

    // Also store the raw button signal for any code that still needs it
    vcu.r2d_button_signal = current_r2d_button;

    vcu.ignition_switch_signal = HAL_GPIO_ReadPin(int1_ign_GPIO_Port, int1_ign_Pin);
    vcu.ignition_ad = 0;

    // State transitions
    switch (current_state) {
        case STATE_INIT:
            current_state = STATE_STANDBY;  // Transition to standby state after initialization
            break;
        case STATE_STANDBY:
            // if precharge is request either for manual or autonomous mode start the precharge

            if (vcu.ignition_switch_signal) {
                current_state = STATE_PRECHARGE;  // Transition to precharge state
                vcu.manual = true;                // Set manual mode
                vcu.autonomous = false;           // Clear autonomous mode
            } else if (vcu.ignition_ad) {
                current_state = STATE_PRECHARGE;  // Transition to precharge state
                vcu.manual = false;               // Clear manual mode
                vcu.autonomous = true;            // Set autonomous mode
            }
            break;

        case STATE_PRECHARGE:
            // when the precharge is done, wait for the ready to drive signal to start the ready to drive
            // either from manual or autonomous mode

            if (!vcu.ignition_switch_signal && !vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (vcu.precharge_signal) {
                current_state = vcu.manual ? STATE_WAITING_FOR_R2D_MANUAL : STATE_WAITING_FOR_R2D_AUTO;
            }
            break;

        case STATE_WAITING_FOR_R2D_MANUAL:

            if (!vcu.ignition_switch_signal) {
                current_state = STATE_STANDBY;
            } else if (vcu.r2d_toggle_signal && vcu.brake_pressure > 10) {
                current_state = STATE_READY_MANUAL;
            }
            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            if (!vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (vcu.r2d_autonomous_signal) {
                current_state = STATE_READY_AUTONOMOUS;
            }
            break;

        case STATE_READY_MANUAL:

            if (!vcu.ignition_switch_signal) {
                // Change to standby if ignition is off
                current_state = STATE_STANDBY;
            } else if (!vcu.r2d_toggle_signal) {
                // Change to waiting for R2D manual if the button is pressed again
                current_state = STATE_WAITING_FOR_R2D_MANUAL;
            }
            break;

        case STATE_READY_AUTONOMOUS:
            // serve as gateway to the computer to send the commands to the inverter

            if (!vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (!vcu.r2d_autonomous_signal) {
                current_state = STATE_WAITING_FOR_R2D_AUTO;
            }
            break;

        case STATE_AS_EMERGENCY:
            // if the emergency is detected, sound the buzzer
            // TODO fazer isto verificar com os autonomos e o bruno
            break;
    }

    // Execute entry actions when state has changed
    if (current_state != previous_state) {
#ifdef print_state
        print_state_transition(previous_state, current_state);
#endif
        // State entry actions
        switch (current_state) {
            case STATE_INIT:
                break;

            case STATE_STANDBY:
                // Reset critical flags when entering standby
                vcu.manual = false;
                vcu.autonomous = false;
                vcu.precharge_signal = 0;           // Reset precharge signal
                vcu.r2d_button_signal = false;      // Reset R2D button signal
                vcu.r2d_toggle_signal = false;      // Reset R2D toggle signal
                vcu.r2d_autonomous_signal = false;  // Reset R2D autonomous signal
                ResetR2DSound();                    // Reset R2D sound state
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);
                HAL_GPIO_WritePin(GPIOB, dout2_r2d_led_Pin, GPIO_PIN_RESET);
                HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
                vcu.r2d_button_signal = false;  // Reset R2D button signal
                break;

            case STATE_PRECHARGE:
                // Precharge state entry actions
                HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);        // Turn on ignition LED
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_SET);  // Activate BMS ignition
                break;

            case STATE_WAITING_FOR_R2D_AUTO:
            case STATE_WAITING_FOR_R2D_MANUAL:
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_SET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);  // Turn off R2D LED
                ResetR2DSound();                                        // Reset R2D sound state
                break;

            case STATE_READY_MANUAL:
            case STATE_READY_AUTONOMOUS:
                // Common setup for ready states

