FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
                HAL_GPIO_WritePin(GPIOB, dout2_r2d_led_Pin, GPIO_PIN_SET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);

                // Play R2D sound when entering a ready state
                StartR2DSound();
                break;

            case STATE_AS_EMERGENCY:
                // Emergency entry actions
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);
                break;
        }
    }
}

/**
 * @brief Handle actions specific to the current state
 */
void HandleState(void) {
    // Update R2D sound status if it's playing
    UpdateR2DSound();

    switch (current_state) {
        case STATE_INIT:
            // Initialization actions
            break;

        case STATE_STANDBY:
            // Turn off R2D LED

            break;

        case STATE_PRECHARGE:
            // Handle precharge process
            HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);
            break;

        case STATE_WAITING_FOR_R2D_MANUAL:
            // Waiting indicator for manual mode
            // fade in and out the R2D LED
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            led_fade_nonblocking(GPIOB, dout2_r2d_led_Pin);
            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            // Waiting indicator for autonomous mode
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            led_fade_nonblocking(GPIOB, dout2_r2d_led_Pin);
            break;

        case STATE_READY_MANUAL:
            // Process manual driving controls
            // Send pedal position to inverter

            break;

        case STATE_READY_AUTONOMOUS:
            // Forward autonomous commands to inverter

            break;

        case STATE_AS_EMERGENCY:
            // Activate emergency indicators
            // Sound buzzer
            break;
    }
}

/**
 * @brief Initialize moving average buffers for APPS
 */
void MovingAverage_Init(void) {
    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        apps1_buffer[i] = 0;
        apps2_buffer[i] = 0;
    }
    apps_buffer_pos = 0;
    apps1_avg = 0;
    apps2_avg = 0;
}

/**
 * @brief Update moving average with new APPS values
 * @param apps1_raw Raw value from APPS1 sensor
 * @param apps2_raw Raw value from APPS2 sensor
 * @return None, updates apps1_avg and apps2_avg global variables
 */
void MovingAverage_Update(uint16_t apps1_raw, uint16_t apps2_raw) {
    // Add new values to buffers
    apps1_buffer[apps_buffer_pos] = apps1_raw;
    apps2_buffer[apps_buffer_pos] = apps2_raw;

    // Update position for next entry
    apps_buffer_pos = (apps_buffer_pos + 1) % APPS_MA_WINDOW_SIZE;

    // Calculate averages
    uint32_t sum1 = 0;
    uint32_t sum2 = 0;

    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        sum1 += apps1_buffer[i];
        sum2 += apps2_buffer[i];
    }

    apps1_avg = (uint16_t)(sum1 / APPS_MA_WINDOW_SIZE);
    apps2_avg = (uint16_t)(sum2 / APPS_MA_WINDOW_SIZE);
}

/* CAN variables for CAN1, CAN2, and CAN3 */
CAN_TxHeaderTypeDef TxHeader_CAN1;
uint8_t TxData_CAN1[8];
uint32_t TxMailbox_CAN1;

//-------------------------------------------
CAN_TxHeaderTypeDef TxHeader_CAN2;
uint8_t TxData_CAN2[8];
uint32_t TxMailbox_CAN2;

//-------------------------------------------
CAN_TxHeaderTypeDef TxHeader_CAN3;
uint8_t TxData_CAN3[8];
uint32_t TxMailbox_CAN3;

CAN_RxHeaderTypeDef RxHeader;
uint8_t RxData[8];

can_data_t can_data1;  // CAN data structure for CAN1
can_data_t can_data2;  // CAN data structure for CAN2
can_data_t can_data3;  // CAN data structure for CAN3

volatile bool can1_rx_flag = false;
volatile bool can2_rx_flag = false;
volatile bool can3_rx_flag = false;

void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan) {
    if (HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &RxHeader, RxData) != HAL_OK) {
        Error_Handler();
        if (hcan->Instance == CAN1) {
            can_data1.id = RxHeader.StdId;
            can_data1.length = RxHeader.DLC;
            for (int i = 0; i < RxHeader.DLC; i++) {
                can_data1.message[i] = RxData[i];
            }
            can1_rx_flag = true;

        } else if (hcan->Instance == CAN2) {
            can_data2.id = RxHeader.StdId;
            can_data2.length = RxHeader.DLC;
            for (int i = 0; i < RxHeader.DLC; i++) {
                can_data2.message[i] = RxData[i];
            }
            can2_rx_flag = true;

        } else if (hcan->Instance == CAN3) {
            can_data3.id = RxHeader.StdId;
            can_data3.length = RxHeader.DLC;
            for (int i = 0; i < RxHeader.DLC; i++) {
                can_data3.message[i] = RxData[i];
            }
            can3_rx_flag = true;
        }
    }
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
    /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
    /* USER CODE END 1 */

    /* MPU Configuration--------------------------------------------------------*/
    MPU_Config();

    /* Enable the CPU Cache */

    /* Enable I-Cache---------------------------------------------------------*/
    SCB_EnableICache();

    /* Enable D-Cache---------------------------------------------------------*/
    SCB_EnableDCache();

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_ADC3_Init();
    MX_CAN1_Init();
    MX_ADC1_Init();
    MX_ADC2_Init();
    MX_CAN2_Init();
    MX_CAN3_Init();
    /* USER CODE BEGIN 2 */

